{
  "_type": "dog",
  "name": "Jumbo",
  "slug": {
    "_type": "slug",
    "current": "jumbo-jet"
  },
  "status": "available",
  "sex": "male",
  "age": "4 years",
  "color": "Black and White",
  "description": "Meet Jumbo (aka \"Jet\") – the handsome black-and-white clown who's as sweet as he is silly! At 4 years old, this big guy has officially settled into foster life and is ready to board his flight straight into a forever home.\n\nJumbo came to rescue after a tough start, spending over a month in the shelter after being removed from a neglect situation. You'd never guess it though—this boy has embraced family life with open paws and a wagging tail.\n\nWhen he's not playing with his foster Dane buddy, he's perfectly content stretched out on the couch, showing off his couch potato credentials. Jumbo is also a total people-dog—he's been friendly with everyone he's met, from kids to adults, and he lights up when his foster sister gets home from school. (He has an adorable \"happy nudge\" routine just for her.)\n\nJumbo's Best Qualities:\n• Playful + social with large dogs (instant BFF with his foster brother)\n• Professional couch potato & snuggle buddy\n• Calm car rider—hops right in and settles for the ride\n• Affectionate leaner and loves attention\n• Kid-approved – gentle and sweet with children\n• Knows sit, down, and come + walks well on leash\n• Trustworthy with free roam (just snoozes on the couch!)\n• Zero food or toy aggression – easygoing at mealtimes\n• A little mouthy when excited, but always gentle and playful\n• Housetrained and accident-free in his foster home\n\nExtra Notes:\n* Jumbo is currently on Apoquel for a paw lesion and will see a dermatologist soon for a long-term plan.\n* He's working on crate training—he prefers free roam but is improving with practice.\n* No known experience with cats or small dogs yet, but he's been great with big-dog friends.\n\nThe perfect home for Jumbo? One with another playful pup and/or respectful kids to love on. He doesn't need tons of exercise—just short walks and backyard play sessions keep him happy. Mostly, he just wants a soft couch, a loving family, and a forever spot to call home.\n\nIf you're ready for a snuggly, goofy, easygoing companion, Jumbo Jet is ready for takeoff—straight into your heart.\n\nApply to foster or foster-to-adopt Jumbo today—and help this sweet boy start his next chapter!\n\nIf you would like to adopt or foster-to adopt Jumbo, submit your application on our website. If you are already an approved family, reach out to Candice at placements@rmgreatdane.org.",
  "medicalNotes": "Currently on Apoquel for a paw lesion; dermatologist visit pending. Working on crate training; improving. No known experience with cats/small dogs yet.",
  "goodWith": ["kids", "dogs"],
  "spayedNeutered": true,
  "vaccinated": true,
  "microchipped": true
}
